## ■ R studio를 켤 때 emp3.csv가 자동으로 로드되게 하는 방법
```
c:\program files\r\r-3.6.3\etc\
rprofile.site
```

In [1]:
getwd()

[1] "D:/R"

#### ■ 일반함수
```
        Oracle     vs        R
       nvl함수              is.na
      decode 함수           ifelse
      case 함수             ifelse
      ```

##### 예제: 이름, 월급, 등급을 출력하는데 월급이 1500 이상이면 등급을 A로 출력하고 아니면 B로 출력
```sql
select ename, sal, case when sal >= 1500 then 'A'
                        else 'B' end as 등급
    from emp;
    ```

In [1]:
library(data.table)
library(doBy)

Warning message:
"package 'data.table' was built under R version 3.6.3"Warning message:
"package 'doBy' was built under R version 3.6.3"

In [6]:
orderBy(~-월급,data.table(이름=emp$ename, 월급=emp$sal, 등급=ifelse(emp$sal>=1500,'A','B')))

   이름   월급 등급
1  KING   5000 A
2  FORD   3000 A
3  SCOTT  3000 A
4  JONES  2975 A
5  BLAKE  2850 A
6  CLARK  2450 A
7  ALLEN  1600 A
8  TURNER 1500 A
9  MILLER 1300 B
10 MARTIN 1250 B
11 WARD   1250 B
12 ADAMS  1100 B
13 JAMES   950 B
14 SMITH   800 B

### ※ 문제41. 이름, 직업, 보너스를 출력하는데 직업이 SALESMAN이면 보너스를 4000을 출력하고 ANALYST면 보너스를 6000을 출력하고 나머지 사원들은 0을 출력하시오

In [11]:
orderBy(~-보너스,data.frame(emp$ename, emp$job, 보너스=ifelse(emp$job=='SALESMAN',4000,ifelse(emp$job=='ANALYST',6000,0))))

   emp.ename emp.job   보너스
10 FORD      ANALYST   6000
12 SCOTT     ANALYST   6000
5  MARTIN    SALESMAN  4000
6  ALLEN     SALESMAN  4000
7  TURNER    SALESMAN  4000
9  WARD      SALESMAN  4000
1  KING      PRESIDENT    0
2  BLAKE     MANAGER      0
3  CLARK     MANAGER      0
4  JONES     MANAGER      0
8  JAMES     CLERK        0
11 SMITH     CLERK        0
13 ADAMS     CLERK        0
14 MILLER    CLERK        0

### ※ 문제42. emp 테이블 프레임에 bonus라는 컬럼을 추가하고 위의 문제 41번의 보너스로 값을 갱신하시오

In [15]:
emp$bonus=ifelse(emp$job=='SALESMAN',4000,ifelse(emp$job=='ANALYST',6000,0))
print(data.frame(이름=emp$ename,보너스=emp$bonus))
print(emp)

     이름 보너스
1    KING      0
2   BLAKE      0
3   CLARK      0
4   JONES      0
5  MARTIN   4000
6   ALLEN   4000
7  TURNER   4000
8   JAMES      0
9    WARD   4000
10   FORD   6000
11  SMITH      0
12  SCOTT   6000
13  ADAMS      0
14 MILLER      0
   index empno  ename       job  mgr        hiredate  sal comm deptno bonus
1      1  7839   KING PRESIDENT   NA 1981-11-17 0:00 5000   NA     10     0
2      2  7698  BLAKE   MANAGER 7839 1981-05-01 0:00 2850   NA     30     0
3      3  7782  CLARK   MANAGER 7839 1981-05-09 0:00 2450   NA     10     0
4      4  7566  JONES   MANAGER 7839 1981-04-01 0:00 2975   NA     20     0
5      5  7654 MARTIN  SALESMAN 7698 1981-09-10 0:00 1250 1400     30  4000
6      6  7499  ALLEN  SALESMAN 7698 1981-02-11 0:00 1600  300     30  4000
7      7  7844 TURNER  SALESMAN 7698 1981-08-21 0:00 1500    0     30  4000
8      8  7900  JAMES     CLERK 7698 1981-12-11 0:00  950   NA     30     0
9      9  7521   WARD  SALESMAN 7698 1981-02-23 0:00 1250  500     30  4000
10    10  7902   FORD   ANALYST 7566 1981-12-11 0:00 3000   NA     20  6000
11    11  7369  SMITH     CLERK 7902 1980-12-09 0:00  800   NA     20     0
12    12  7788  SCOTT   ANALYST 7566 1982-12-22 0:00 3000   NA     20  6000
13    13  7876  ADAMS     CLERK 7788 1983-01-15 0:00 1100   NA     20     0
14    14  7934 MILLER     CLERK 7782 1982-01-11 0:00 1300   NA     10     0

### ※ 문제43. is.na 함수를 이용해서 커미션이 NA인 사원들의 이름과 커미션을 출력하시오

In [18]:
emp[is.na(emp$comm),c('ename','comm')]

   ename  comm
1  KING   NA
2  BLAKE  NA
3  CLARK  NA
4  JONES  NA
8  JAMES  NA
10 FORD   NA
11 SMITH  NA
12 SCOTT  NA
13 ADAMS  NA
14 MILLER NA

### ※ 문제44. 이름과 커미션을 출력하는데 커미션이 NA인 사원들은 no comm으로 출력되게 하시오
```sql
select ename, nvl(to_char(comm),'no comm')
    from emp;
    ```

In [25]:
data.frame(이름=emp$ename,comm=ifelse(is.na(emp$comm),'no comm',emp$comm))

   이름   comm
1  KING   no comm
2  BLAKE  no comm
3  CLARK  no comm
4  JONES  no comm
5  MARTIN 1400
6  ALLEN  300
7  TURNER 0
8  JAMES  no comm
9  WARD   500
10 FORD   no comm
11 SMITH  no comm
12 SCOTT  no comm
13 ADAMS  no comm
14 MILLER no comm

#### ■ 그룹함수
```
        Oracle      vs       R
        max                  max
        min                  min
        sum                  sum
        avg                  mean
        count                length(세로)
                             table(가로)
                             ```

### ※ 문제45. 최대 월급을 출력하시오

In [27]:
print(max(emp$sal))

[1] 5000

### ※ 문제46. 직업이 SALESMAN인 사원들의 최대월급을 출력하시오

In [37]:
rs=emp[emp$job=='SALESMAN','sal']
max(rs)

[1] 1600

### ※ 문제47. 20번 부서번호인 사원들 중에서 최소월급을 출력하시오

In [38]:
rs=emp[emp$deptno==20,'sal']
print(min(rs))

[1] 800

### ※ 문제48. 직업, 직업별 최대월급을 출력하시오
```sql
select job, max(sal)
    from emp
    group by job;
    ```

In [40]:
aggregate(sal~job,   emp,   max)
#        column 범위데이터  그룹함수

  job       sal
1 ANALYST   3000
2 CLERK     1300
3 MANAGER   2975
4 PRESIDENT 5000
5 SALESMAN  1600

### ※ 문제49. 부서번호, 부서번호별 토탈월급을 출력
```sql
select deptno, sum(sal)
    from emp
    group by deptno;
    ```

In [3]:
emp=read.csv('emp3.csv',header=T)
aggregate(sal~deptno, emp, sum)

  deptno sal
1 10      8750
2 20     10875
3 30      9400

### ※ 문제50. 위의 결과를 다시 출력하는데 토탈월급이 높은 것 부터 출력하시오

In [5]:
rs=aggregate(sal~deptno,emp,sum)
names(rs)=c('부서번호','토탈월급')
orderBy(~-토탈월급,rs)

  부서번호 토탈월급
2 20       10875
3 30        9400
1 10        8750

### ※ 문제51. 직업, 직업별 인원수를 출력하시오

In [7]:
aggregate(empno~job,emp,length)

  job       empno
1 ANALYST   2
2 CLERK     4
3 MANAGER   3
4 PRESIDENT 1
5 SALESMAN  4